## dev: pinpoint_to_sqs_sms_callbacks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 0 to add, 3 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                          NAME                           |
|--------|---------------------------------------------------------|
| update | `aws_cloudwatch_log_group.pinpoint_deliveries`          |
|        | `aws_cloudwatch_log_group.pinpoint_deliveries_failures` |
|        | `aws_iam_policy.pinpoint_logs`                          |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.pinpoint_logs will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "pinpoint_logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:DescribeLogStreams",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:ca-central-1:800095993820:log-group:sns/ca-central-1/800095993820/PinpointDirectPublishToPhoneNumber/Failure:*",
              + "arn:aws:logs:ca-central-1:800095993820:log-group:sns/ca-central-1/800095993820/PinpointDirectPublishToPhoneNumber:*",
            ]
        }
    }

  # aws_cloudwatch_log_group.pinpoint_deliveries will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "pinpoint_deliveries" {
        id                = "sns/ca-central-1/800095993820/PinpointDirectPublishToPhoneNumber"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ name              = (sensitive value)
        tags              = {
            "CostCenter" = "notification-canada-ca-dev"
        }
        # (7 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.pinpoint_deliveries_failures will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "pinpoint_deliveries_failures" {
        id                = "sns/ca-central-1/800095993820/PinpointDirectPublishToPhoneNumber/Failure"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ name              = (sensitive value)
        tags              = {
            "CostCenter" = "notification-canada-ca-dev"
        }
        # (7 unchanged attributes hidden)
    }

  # aws_iam_policy.pinpoint_logs will be updated in-place
  ~ resource "aws_iam_policy" "pinpoint_logs" {
        id               = "arn:aws:iam::800095993820:policy/PinpointLogsPolicy"
        name             = "PinpointLogsPolicy"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:DescribeLogStreams",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:ca-central-1:800095993820:log-group:sns/ca-central-1/800095993820/PinpointDirectPublishToPhoneNumber:*",
                          - "arn:aws:logs:ca-central-1:800095993820:log-group:sns/ca-central-1/800095993820/PinpointDirectPublishToPhoneNumber/Failure:*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.pinpoint_deliveries"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.pinpoint_deliveries_failures"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.pinpoint_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.pinpoint_logs"]

23 tests, 19 passed, 4 warnings, 0 failures, 0 exceptions

```

</details>
